#include<stdio.h>
#include<locale.h>
int main()
{
	setlocale(LC_ALL, "RUS");
	int a, b;
	printf("¬ведите число a и b\n");
	scanf_s("%d %d", &a, &b);
	char z, x;
	z = 'a';
	x = 'b';
	printf("_______________________________________________________________________________\n");
	printf("| %10c * %-10c | %10c + %-10c | %10c - %-10c |\n",z, x, z, x, z, x, z, x);
	printf("_______________________________________________________________________________\n");
	printf("| %10d * %-10d | %10d + %-10d | %10d - %-10d |\n", a, b, a, b, a, b);
	printf("_______________________________________________________________________________\n");
	printf("| %12d\t\t  | %12d\t    | %12d\t      |\n", a * b, a + b, a - b); 
	system("pause");
}